using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace ConsoleApp15
{
    internal class A
    {
        /*static void Main(string[] args)
        {
            while (true)
            {
                string? str = Console.ReadLine();
                if (str == null) break;
                int a, b;
                string[] arr = str.Split(' ');
                if (arr.Count() > 1)
                {
                    bool isAint = Int32.TryParse(arr[0], out a);
                    bool isBint = Int32.TryParse(arr[1], out b);
                    if (isAint && isBint)
                    {
                        Console.WriteLine(a + b);
                    }
                }
            }

        }*/
    }
}

///
/*Напишите программу, которая выводит сумму двух целых чисел.

Входные данные
В первой строке входных данных содержится целое число t (1≤t≤104) — количество наборов входных данных в тесте.

Далее следуют описания t наборов входных данных, один набор в строке.

В первой (и единственной) строке набора записаны два целых числа a и b (−1000≤a, b≤1000).

Выходные данные
Для каждого набора входных данных выведите сумму двух заданных чисел, то есть a+b.*/